export async function getBankName(bankCode: string) {

    let payload : { [unit: string]: string } = {
        '002' : 'ธนาคารกรุงเทพ',
        '004' : 'ธนาคารกสิกรไทย',
        '006' : "ธนาคารกรุงไทย",
        '011_2' : "ธนาคารทหารไทยธนชาต",
        '014' : "ธนาคารไทยพาณิชย์",
        '025' : "ธนาคารกรุงศรีอยุธยา",
        '069' : "ธนาคารเกียรตินาคินภัทร",
        '022' : "ธนาคารซีไอเอ็มบีไทย",
        '067' : "ธนาคารทิสโก้",
        '024' : "ธนาคารยูโอบี",
        '071' : "ธนาคารไทยเครดิตเพื่อรายย่อย",
        '073' : "ธนาคารแลนด์ แอนด์ เฮ้าส์ ",
        '070' : "ธนาคารไอซีบีซี (ไทย)",
        '034' : "ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร",
        '030' : "ธนาคารออมสิน",
        '033' : "ธนาคารอาคารสงเคราะห์ ",
        '066' : "ธนาคารอิสลามแห่งประเทศไทย",
    }
    
    try {
        if(payload[bankCode]){
            return payload[bankCode]
        }else{
            return 'ไม่สามารถหาข้อมูลได้'
        }
    } catch (error) {
        return 'ไม่สามารถหาข้อมูลได้'
    }
}